package co.feip.fefu2025

object Anime {
    val animeList = listOf(
        AnimeData(
            "Форма голоса",
            R.drawable.anime1,
            "8.93",
            listOf("Сёнен", "Драма"),
            "Сложно представить, сколько лет должно пройти, " +
                    "пока до примерного задиры и разгильдяя дойдет, каким " +
                    "глупцом он был, когда веселья ради издевался над инвалидом. " +
                    "Кто-то об этом даже не вспомнит. А кто-то вроде Сёи возненавидит " +
                    "себя крепкой ненавистью. В младшей школе он умудрился превратить " +
                    "жизнь одноклассницы по имени Сёко в ад. Только потому, что та " +
                    "была глухая, не как все. И теперь, несколько лет спустя, хоть и " +
                    "запоздало, но мальчишка понял: чтобы сказать нечто важное тому, " +
                    "кто не может тебя услышать, вовсе не обязательно использовать голос.",
            "2016 г.",
            1
        ),
        AnimeData(
            "Монстр",
            R.drawable.anime2,
            "8.88",
            listOf("Сэйнэн", "Драма", "Тайна", "Триллер"),
            "Действие происходит в Германии, в Дюссельдорфе. Неизвестный " +
                    "проникает в дом семьи Либертов, убивает родителей и простреливает " +
                    "их сыну голову, не трогает лишь его сестру, которая забывает всё от " +
                    "шока. В том же городе работает гениальный японский нейрохирург Кэндзо " +
                    "Тэмма, сумевший спасти жизнь мальчика.\n" +
                    "Спустя много лет раненого человека привозят в госпиталь. Спасши ему жизнь, " +
                    "Кэндзо узнаёт, что тот причастен к продолжающимся в Германии серийным " +
                    "убийствам. Вскоре и Кэндзо оказывается замешан в этом деле, когда у него на " +
                    "глазах тот самый спасённый ребёнок, выросший теперь в юношу, хладнокровно " +
                    "убивает спасённого человека.\n" +
                    "Кэндзо предстоит очистить своё имя, узнать о спасённом им много лет назад " +
                    "ребёнке и переосмыслить саму ценность жизней, которые он спасает, " +
                    "работая хирургом.",
            "2004-2005 гг.",
            74
        ),
        AnimeData(
            "Психопаспорт",
            R.drawable.anime3,
            "8.33",
            listOf("Экшен", "Тайна", "Фантастика", "Триллер"),
            "Япония, XXII век. С целью предотвращения преступлений " +
                    "была разработана система Sibyl. Это позволило объективно " +
                    "определять уровень угрозы у каждого гражданина путем проверки " +
                    "его психического состояния на наличие признаков преступного " +
                    "умысла. Данный метод получил название Психопаспорт. " +
                    "Поддерживают закон инспекторы, которые при малейшем признаке " +
                    "недоброжелательности у гражданина имеют право незамедлительно " +
                    "применять против него оружие.",
            "2012-2013 гг.",
            22
        ),
        AnimeData(
            "Эрго Прокси",
            R.drawable.anime4,
            "7.9",
            listOf("Тайна", "Фантастика", "Триллер"),
            "Когда с андроидами-авторейвами начинают происходить неприятности, " +
                    "за расследование происшествий берется Рил Мейер, сотрудница разведки. " +
                    "Работника управления авторейвов Винсента Лоу преследует таинственный " +
                    "гуманоидный монстр Прокси... Дороги Рил и Винсента пересекаются.",
            "2006 г.",
            23
        ),
        AnimeData(
            "Эксперименты Лэйн",
            R.drawable.anime5,
            "8.09",
            listOf("Авангард", "Драма", "Тайна", "Фантастика", "Сверхъестественное", "Триллер"),
            "Лэйн Ивакура кажется совсем обычной девочкой, которая толком не " +
                    "имеет даже опыта работы на компьютере, да и с людьми не особо сходится. " +
                    "Но после внезапного самоубийства одной из школьниц, странных слухов об" +
                    " этом и попыток одноклассниц вытащить её куда-нибудь, она постепенно " +
                    "понимает, что всё в этом мире на самом деле совсем не такое, каким " +
                    "представляется... Даже она сама...",
            "1998 г.",
            13
        ),
        AnimeData(
            "Бугипоп никогда не смеётся",
            R.drawable.anime6,
            "7.15",
            listOf("Авангард", "Драма", "Ужасы", "Тайна", "Сверхъестественное", "Триллер"),
            "Сюжет посвящён нескольким персонажам, большинство из которых — студенты" +
                    " одного университета в городе, где и происходят все события. Город, название " +
                    "которого не упоминается, был потрясён убийствами девушек серийным маньяком " +
                    "пять лет назад, который был найден повешенным.",
            "2000 г.",
            12
        ),
        AnimeData(
            "Идеальная грусть",
            R.drawable.anime7,
            "8.55",
            listOf("Авангард", "Драма", "Ужасы", "Триллер"),
            "Мима Киригоэ, участница поп-группы «CHAM!», решает бросить " +
                    "карьеру певицы, чтобы попробовать себя в качестве актрисы. " +
                    "Некоторые её фанаты недовольны этим решением — в особенности " +
                    "невменяемый и начавший преследовать девушку парень, который называет " +
                    "себя Мэмания. По мере продвижения Мимы в новой карьере близкие ей " +
                    "люди погибают от рук жестокого убийцы, и вскоре Мима постепенно " +
                    "теряет способность отличать реальность от вымысла...",
            "1998 г.",
            1
        ),
        AnimeData(
            "Призрак в доспехах",
            R.drawable.anime8,
            "8.27",
            listOf("Сэйнэн", "Экшен", "Тайна", "Фантастика", "Триллер"),
            "2029 год. Благодаря значительным достижениям в кибернетике " +
                    "люди могут заменять свои конечности роботизированными частями. " +
                    "Майор Мотоко Кусанаги из 9-го отдела службы безопасности ведёт " +
                    "расследование, связанное с таинственным хакером, который называет " +
                    "себя Кукловод.",
            "1985 г.",
            1

        ),
        AnimeData(
            "Технолайз",
            R.drawable.anime9,
            "7.76",
            listOf("Авангард", "Драма", "Тайна", "Фантастика", "Триллер"),
            "Люкс — подземный город, который был построен ради одного " +
                    "эксперимента, но люди, живущие на поверхности, забыли о нем. " +
                    "Жители Люкса оказались в отчаянном положении. В городе установилось " +
                    "хрупкое равновесие сил между взявшими верх группировками. Была " +
                    "изобретена технология «Технолайз», которая «помогает» управлять " +
                    "городом. Теперь некоторые люди Люкса обладают технолизированными " +
                    "конечностями, похожими на протезы. Действие сериала разворачивается " +
                    "вокруг Итисэ — уличного бойца, одного из потомков первых сосланных под " +
                    "землю людей. Чем же станет «Технолайз» — спасением города или же " +
                    "его разрушением?",
            "2003 г.",
            22
        ),
        AnimeData(
            "Берсерк",
            R.drawable.anime10,
            "8.6",
            listOf("Сэйнэн", "Экшен", "Приключения", "Драма", "Фэнтези", "Ужасы"),
            "Отважный молодой воин Гатс испытывает судьбу в качестве наёмника на " +
                    "передовой. Роковая встреча сводит Гатса с харизматичным и беспощадным " +
                    "юношей по имени Гриффит. Возглавляя непобедимый отряд, известный как " +
                    "«Банда Ястреба», Гриффит владеет грозной силой, несравнимой ни с чем. " +
                    "Движимые стремлением к статусу, «ястребы» проявляют невиданную доселе " +
                    "доблесть в военных делах и выдержку в делах политических. Армии Мидланда " +
                    "содрогнутся в страхе, когда Гриффит и Гатс вступят на путь, на котором им " +
                    "суждено поставить мир на колени.",
            "1997-1998 гг.",
            25
        ),
        AnimeData(
            "Ковбой Бибоп",
            R.drawable.anime11,
            "8.75",
            listOf("Экшен", "Фантастика"),
            "Бывший полицейский Джет Блэк и человек с тёмным прошлым " +
                    "Спайк Шпигель совершенно не планировали увеличивать экипаж космического " +
                    "корабля «Бибоп», являющегося для них домом и средством передвижения. " +
                    "Но сети, раскинутые для поимки дорогостоящих отбросов общества, " +
                    "принесли им Фэй Валентайн — очаровательную картёжницу с колоссальным долгом, " +
                    "Эд — потерявшуюся компьютерную умницу и Эйн — предположительно, самую умную " +
                    "собаку на свете. Именно в таком составе экипаж «Бибопа» и продолжает своё " +
                    "дело — охоту за головами.",
            "1998-1999 гг.",
            26
        ),
        AnimeData(
            "Самурай Чамплоу",
            R.drawable.anime12,
            "8.51",
            listOf("Экшен", "Приключения", "Комедия"),
            "Мугэн - мечник с повадками брейкдансера, вспыльчивый, грубый " +
                    "и вечно голодный мужлан. Дзин - благородный, хорошо воспитанный ронин, " +
                    "чьё прошлое скрывает мрачную тайну.\n" +
                    "Нет в мире двух других самураев, настолько непохожих друг на друга - а судьба " +
                    "не только сводит их в поединке, но и заставляет присоединиться к Фуу, " +
                    "целеустремленной юной особе, озабоченной поисками таинственного самурая, " +
                    "пахнущего подсолнухами. Это история о любви, дружбе и мужестве... или нет?!",
            "2004-2005 гг.",
            26
        ),
        AnimeData(
            "Оглянись",
            R.drawable.anime13,
            "8.64",
            listOf("Сёнен", "Драма"),
            "Четвероклассница Фудзино рисует короткие комиксы для школьной газеты. " +
                    "Взрослые и одноклассники хвалят её талант, но однажды она видит работу " +
                    "ровесницы Кёмото, которая, хоть и не посещает школу, тоже рисует для этой " +
                    "же газеты. Поражённая её уровнем мастерства Фудзино решает научиться " +
                    "рисовать лучше. Два года девочка проводит в непрерывных занятиях, но, " +
                    "поняв, что угнаться за тем уровнем у неё не получается, бросает рисовать. " +
                    "Заканчивается начальная школа, и учитель просит Фудзино отнести Кёмото " +
                    "диплом об окончании.",
            "2024 г.",
            1

        ),
        AnimeData(
            "Лиз и синяя птица",
            R.drawable.anime14,
            "8.22",
            listOf("Драма"),
            "Две лучшие подруги Мидзорэ и Нодзоми учатся в выпускном классе и " +
                    "состоят в клубе школьного духового оркестра. Тихая и застенчивая " +
                    "Мидзорэ играет на гобое, а жизнерадостная Нодзоми — на флейте. " +
                    "Однажды клуб начинает репетировать музыку, вдохновлённую сказкой " +
                    "«Лиз и голубая птица». Флейта и гобой изображают Лиз и Девушку, " +
                    "которые в конце обязательно расстаются. Погрузившись в эту удивительную " +
                    "историю, Мидзорэ и Нодзоми начинают осознавать, что сами не смогут быть " +
                    "вместе всегда.",
            "2018 г.",
            1
        ),
        AnimeData(
            "Нана",
            R.drawable.anime15,
            "8.32",
            listOf("Сёдзё", "Драма", "Романтика"),
            "Нана Комацу, милая и наивная девушка, переезжает вслед за своим парнем " +
                    "Сёдзи в Токио, где надеется зажить с ним счастливой жизнью, о которой она " +
                    "всегда мечтала. В поезде на пути в Токио она знакомится с Наной Осаки, " +
                    "сильной и волевой девушкой, вокалисткой рок-группы, также переезжающей в " +
                    "Токио ради мечты стать профессиональным музыкантом. Они полные " +
                    "противоположности друг друга, но, будучи тёзками, легко находят общий язык." +
                    "Повторно судьба сводит их уже в Токио: на осмотре квартиры, которую " +
                    "каждая из них хотела бы снять. Девушки сильно стеснены в средствах, " +
                    "но найденный вариант просто отличный... Друг с другом они вроде бы ладят, " +
                    "так почему бы не попробовать снять квартиру на двоих?",
            "2006-2007 гг.",
            47
        ),
        AnimeData(
            "Сказ о четырёх с половиной татами",
            R.drawable.anime16,
            "8.55",
            listOf("Комедия", "Тайна", "Романтика", "Триллер"),
            "Второкурсник Киотского университета обнаруживает, что жизнь его безнадёжно " +
                    "испорчена. Клуб, куда он вступил, безнадежён, лучший друг оказывается негодяем " +
                    "и подлецом, а других друзей у него нет. Вдобавок, единственную девушку, " +
                    "с которой он хотел сблизиться, увёл его так называемый друг.\n" +
                    "Впрочем, как известно, большинство богов живут в Киото, и наш герой получает " +
                    "второй шанс, столкнувшись поздно ночью в рамэнной с кем-то, называющим себя богом.",
            "2010 г.",
            11
        ),
        AnimeData(
            "Фури-кури",
            R.drawable.anime17,
            "8.04",
            listOf("Экшен", "Авангард", "Комедия", "Фантастика", "Триллер"),
            "Инопланетянка Харуко Харухара сбивает на своем мотороллере ученика начальной " +
                    "школы Наоту Нандабу, но для достижения настоящего эффекта она бьет его своей " +
                    "гитарой по голове, после чего у него из образовавшейся на голове шишки… " +
                    "вырастает робот.",
            "2000-2001 гг.",
            6
        ),
        AnimeData(
            "Трапеция",
            R.drawable.anime18,
            "7.9",
            listOf("Авангард", "Драма"),
            "Эксцентричному психиатру Итиро Ирабу повезло, он сын владельца клиники, " +
                    "и его положение позволяет применять на пациентах любые, самые безумные " +
                    "методы лечения, какие он только в состоянии вообразить.\n" +
                    "Стресс, запущенный нарциссизм или раздвоение личности? Доктор Итиро вам " +
                    "поможет! А если и нет, то всегда рядом Маюми, медсестра в образе готической лолиты!",
            "2009 г.",
            11
        ),
        AnimeData(
            "Мелочи жизни",
            R.drawable.anime19,
            "8.47",
            listOf("Сёнен", "Комедия"),
            "Школьные годы чудесные… Пора юной жизни, когда необычное кроется в " +
                    "повседневном, океан видится в капле воды, и каждый день происходит что-то новое. " +
                    "Так и текут будни ребят и девчат из некоей старшей школы в совершенно нормальном " +
                    "городке: вот только одна из героинь - робот с огромным заводным ключом в спине, " +
                    "другой ездит в школу на белом… козле, а третья достает пистолеты и пулеметы " +
                    "прямо из воздуха. И каждое событие из жизни главных героев - от поедания " +
                    "домашнего обеда до сдачи экзаменов – может в одночасье превратиться в проблему " +
                    "всеяпонского или даже мирового масштаба!",
            "2011 г.",
            26
        ),
        AnimeData(
            "Мононокэ",
            R.drawable.anime20,
            "8.41",
            listOf("Ужасы", "Тайна", "Сверхъестественное", "Триллер"),
            "История рассказывает об Аптекаре, путешествующем по феодальной Японии. " +
                    "Занимается он не столько торговлей, сколько борьбой с мононокэ, " +
                    "разгневанными духами.\n" +
                    "Единственным способом борьбы с мононокэ является необычный клинок Аптекаря, " +
                    "для применения которого необходимо сперва раскрыть «Форму» мононокэ, затем " +
                    "узнать «Суть» произошедших ранее событий и наконец понять «Причину» того, " +
                    "зачем пришел дух. И лишь после выполнения трёх этих условий страдающего " +
                    "мононокэ возможно будет освободить.",
            "2007 г.",
            12
        ),
        AnimeData(
            "Жозе, тигр и рыба",
            R.drawable.anime21,
            "8.38",
            listOf("Драма", "Романтика"),
            "Однажды в незамысловатой жизни студента по имени Цунэо появляется девушка, " +
                    "большую часть своих дней потратившая на чтение и рисование. Занятия " +
                    "похвальные, однако даже им есть своё объяснение. Дело в том, что мечтательная " +
                    "Жозе — так зовет себя девушка на манер героини из произведения Франсуазы " +
                    "Саган «Волшебные облака» — прикована к инвалидному креслу, и многое из жизни " +
                    "обычных людей ей недоступно.\n" +
                    "Благодаря дружбе с Жозе, Цунэо, не особо заботящийся о своей жизни, начинает " +
                    "осознавать ценность того, что имеет. В то время как девушка, не без участия " +
                    "парня, решает, что наконец пришло время встретиться лицом к лицу с реальным " +
                    "миром. Так они, сами того не замечая, помогают друг другу кто как умеет, и в " +
                    "конце концов их дружба начинает обретать иные оттенки, омрачить которые не в " +
                    "силах даже косые взгляды окружающих.",
            "2020 г.",
            1
        ),
        AnimeData(
            "Девочка-волшебница Мадока★Волшебство",
            R.drawable.anime22,
            "8.37",
            listOf("Драма", "Триллер"),
            "14-летняя Мадока Канамэ спокойно жила в современной японской семье с м" +
                    "амой-деловой женщиной, папой-домохозяином и маленьким братиком. " +
                    "Все изменил один неясный сон, где темноволосая девочка сражалась с силами " +
                    "зла в каком-то фантасмагорическом мире. Излишне говорить, что утром Мадока " +
                    "увидела ее в школе, и новая знакомая по имени Хомура Акэми прямым текстом " +
                    "заявила - не стоит посторонним лезть не в свое дело. Но как простая, но " +
                    "честная и справедливая японская школьница может остаться в стороне, когда на " +
                    "глазах убивают милого зверька, а привычный мир, похоже, сходит с ума?",
            "2011 г.",
            12

        ),
        AnimeData(
            "Великий притворщик",
            R.drawable.anime23,
            "8.2",
            listOf("Экшен", "Приключения", "Тайна"),
            "Не будет преувеличением сказать, что Макото Эдамура, вероятно, величайший в " +
                    "Японии мошенник. На пару с подельником Кудо он решает провернуть аферу в Асакусе " +
                    "и обмануть некоего Француза, однако в итоге оказывается обманут сам. Ведь Француз, " +
                    "не давший себя обдурить, — сам Лоран Тьерри, человек настолько влиятельный, что ему " +
                    "подчиняется даже мафия. Теперь Макото и Кудо придётся заниматься грязными делишками, " +
                    "которые поручает им Лоран, и ещё неизвестно, к чему это их приведёт!",
            "2020 г.",
            23
        ),
        AnimeData(
            "Парад смерти",
            R.drawable.anime24,
            "8.32",
            listOf("Драма", "Фэнтези", "Триллер"),
            "Добро пожаловать в бар «Квиндеким». Бар, за типичной обстановкой и " +
                    "приглушённым светом которого скрывается нечто большее. Кажется, что " +
                    "единственным работником этого загадочного заведения является бармен. " +
                    "Он встречает посетителей и объясняет правила: с этой минуты гости вынуждены " +
                    "вступить в смертельную схватку друг с другом, и игра, выбранная в случайном " +
                    "порядке, — их последний шанс спасти свою жизнь. Бар «Квиндеким» — это место, " +
                    "где человек показывает истинную сущность. Где грехи и пороки уже невозможно " +
                    "скрыть. Где ставка — ваша душа.",
            "2015 г.",
            12
        ),
        AnimeData(
            "В этом уголке мира",
            R.drawable.anime25,
            "8.22",
            listOf("Сэйнэн", "Драма"),
            "В жизни Сузу Урано наступают большие перемены: она выходит замуж и " +
                    "переезжает к своему возлюбленному из Хиросимы в город Курэ. Но начинается " +
                    "Вторая мировая война, и жизнь на новом месте будет для неё не такой радужной, " +
                    "как она себе представляла. Впрочем, случались и хорошие дни.",
            "2016 г.",
            1
        ),
        AnimeData(
            "Дорохедоро",
            R.drawable.anime26,
            "8.05",
            listOf("Сэйнэн", "Экшен", "Комедия", "Фэнтези", "Ужасы"),
            "Людям не повезло жить в мире под названием Дыра, куда наведываются " +
                    "маги из параллельного измерения практиковать на бедных человеках свои " +
                    "навыки. Однажды девушка по имени Никайдо находит жертву этих ужасных " +
                    "экспериментов — человека с головой крокодила и амнезией впридачу. Никайдо " +
                    "нарекает нового друга Кайман, и теперь они ловят магов, а Кайман откусывает " +
                    "им головы, пытаясь таким образом вернуть утерянные воспоминания и свой прежний " +
                    "облик. А в это время верховный колдун Эн, помешанный на грибах, решает " +
                    "выследить и убить тех, кто сокращает количество ему подобных.",
            "2020 г.",
            12
        ),
        AnimeData(
            "Цветы зла",
            R.drawable.anime27,
            "7.15",
            listOf("Сёнен", "Драма", "Романтика", "Триллер"),
            "Старшеклассник Такао Касуга, интроверт и книжный червь, живет в небольшом " +
                    "городе, окружённом горами. Осознание своей ущербности и безответную любовь к " +
                    "однокласснице Нанако Саэки парень заглушает, глотая книжки, усиленно штудируя " +
                    "бодлеровские «Цветы зла». Увы, бурление гормонов и мелькание разных мыслей " +
                    "полумерами не унять - Такао утратил контроль и сам не понял, как, оставшись " +
                    "после уроков, украл физкультурную форму любимой Нанако. Этот странный акт " +
                    "отчаяния видела его одноклассница Сава Накамура, но закладывать парня учителям " +
                    "она не спешит, вместо этого девушка начинает шантажировать и манипулировать Такао.",
            "2013 г.",
            13

        ),
        AnimeData(
            "Кэйон!",
            R.drawable.anime28,
            "7.86",
            listOf("Комедия"),
            "Перейдя в старшую школу, беззаботная Юи Хирасава встаёт перед выбором " +
                    "школьного клуба. Тем временем, движимые мечтой о собственной музыкальной " +
                    "группе старшеклассницы Рицу, Мио и Цумуги решают вступить в клуб «Лёгкой " +
                    "музыки». Но все бывшие участники клуба закончили школу в прошлом году, а по " +
                    "правилам в клубе должно состоять не менее четырёх человек.\n" +
                    "Чтобы спасти клуб от закрытия, они принимают к себе Юи, не владеющую ни " +
                    "навыками игры на музыкальных инструментах, ни чтением нотной записи. " +
                    "Тем не менее, участницы клуба не теряют надежды, и ставят своей целью к " +
                    "моменту окончания школы выступить на крупной музыкальной арене «Будокан» в Токио.",
            "2009 г.",
            13
        ),
        AnimeData(
            "Райский поцелуй",
            R.drawable.anime29,
            "7.87",
            listOf("Дзёсей", "Драма", "Романтика"),
            "Всю свою жизнь – с раннего младенчества до нынешних 18-летия – Юкари была " +
                    "хорошей девочкой. Она прекрасно учится и готовится поступить в престижный вуз. " +
                    "Она робко и тайно влюблена в своего одноклассника. И вдруг в один прекрасный " +
                    "день на улице к ней подходит парень с устрашающим пирсингом и просит, чтобы " +
                    "она стала моделью для Paradise Kiss – новой марки одежды молодых, амбициозных " +
                    "и очень альтернативных дизайнеров.\n",
            "2005 г.",
            12
        ),
        AnimeData(
            "91 день",
            R.drawable.anime30,
            "7.83",
            listOf("Экшен", "Драма", "Триллер"),
            "Времена «сухого закона». На глазах мальчика Анджело бандиты убивают всю его " +
                    "семью. Уехав из родных мест с мыслью о мести, Анджело берёт себе имя Авилио и " +
                    "начинает оттачивать необходимые навыки, чтобы покарать мафиозную семью Ванетти, " +
                    "виновную в смерти его родных. Спустя 7 лет Авилио начинает осуществление своего " +
                    "плана, но для начала необходимо втереться в доверие к Неро Ванетти — сыну главы клана.",
            "2016 г.",
            12
        )
    )
}

data class AnimeData(
    val name: String,
    val imageRes: Int,
    val rating: String,
    val genres: List<String>,
    val description: String,
    val year: String,
    val episodes: Int
)
